Конфигурация/Documents/НачислениеДивидендов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>НачислениеДивидендов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗадолженностиПоДенежнымСредствам</xr:Item>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>InformationRegister.ОперацииСЦеннымиБумагами</xr:Item>
				<xr:Item>AccountingRegister.ЕдиныйБухгалтерскийУчет</xr:Item>
				<xr:Item>AccountingRegister.НалоговыйУчет</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Паи</v8:Type>
						<v8:Type>cfg:CatalogRef.ДепозитарныеРасписки</v8:Type>
						<v8:Type>cfg:CatalogRef.Доли</v8:Type>
						<v8:Type>cfg:CatalogRef.ИпотечныеСертификатыУчастия</v8:Type>
						<v8:Type>cfg:CatalogRef.Акции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРеестра</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПубликации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОплатыПлановая</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДивидендыНаЦеннуюБумагу</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦенаДивиденды</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Брокер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рынок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РынкиЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаОбъявленная</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентНалога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Enums/РынкиЦенныхБумаг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>РынкиЦенныхБумаг</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Акции</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Облигации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Паи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Векселя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закладные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИпотечныеСертификатыУчастия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДепозитарныеРасписки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Фьючерсы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Опционы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВалютныеПары</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доли</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДрагоценныеМеталлы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Documents/НачислениеДивидендов/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОБРАБОТЧИКИ_СОБЫТИЙ_ФОРМЫ
/////////////////////////////////////////////////////////////////////////////////

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	ЗаполнитьПодтверждениеОперацииНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	РаботаСЖурналамиОперацийКлиентСервер.ОповеститьЖурналыОбИзменении();
	
	Оповестить("СводноеНачислениеДивидендов.Обновить", Объект.Ссылка);
	
	РаботаСДокументамиКлиент.ПроверитьПараметрыПодтвержденияОперации(ЭтаФорма, Объект, ПараметрыЗаписи);

КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтаФорма.ОплатаЧерезБрокера = 1 Тогда
		ПроверяемыеРеквизиты.Добавить("Брокер");
	КонецЕсли;
	
	Если ЭтаФорма.ДетализацияПоРасчетномуСчету Тогда
		ПроверяемыеРеквизиты.Добавить("РасчетныйСчет");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ПодтверждениеОперации" Тогда
		Если Параметр = Объект.Ссылка
			ИЛИ (ТипЗнч(Параметр) = Тип("Массив") И Параметр.Найти(Объект.Ссылка) <> Неопределено)
		Тогда
			ЗаполнитьПодтверждениеОперацииНаСервере();
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

/////////////////////////////////////////////////////////////////////////////////
#КонецОбласти

#Область ОБРАБОТЧИКИ_СОБЫТИЙ_ЭЛЕМЕНТОВ_ШАПКИ_ФОРМЫ
/////////////////////////////////////////////////////////////////////////////////

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Объект.Дата = РаботаСДокументами.ПолучитьВремяДокумента(Объект.Дата, Объект.Ссылка);
	
	РаботаСДокументамиКлиент.ДетализацияПоРасчетномуСчетуПриИзмененииСвязанныхРеквизитов(ЭтаФорма);
	
	Если Не РаботаСИсполнителями.ЕстьИсполнитель(?(ЭтаФорма.ОплатаЧерезБрокера = 1, "ИсполнителиПоДенежнымСредствамБрокерские", "ИсполнителиПоДенежнымСредствамСобственные"),
		ОбщегоНазначенияКлиентСервер.ПоляВСтруктуру(Объект, "Дата, Организация, СчетДоверительногоУправления, Брокер, РасчетныйСчет"))
	Тогда
		Объект.РасчетныйСчет = Неопределено;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЦеннаяБумагаПриИзменении(Элемент)

	Если НЕ ЗначениеЗаполнено(Объект.ВалютаОплаты) Тогда
		Объект.ВалютаОплаты = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ЦеннаяБумага, "ВалютаНоминала");
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура ОплатаЧерезБрокераПриИзменении(Элемент)
	
	Если ЭтаФорма.ОплатаЧерезБрокера = 0 Тогда
		Объект.Брокер = Неопределено;
	КонецЕсли;
	
	Элементы.Брокер.Видимость = (ЭтаФорма.ОплатаЧерезБрокера = 1); 
	
	БрокерПриИзменении(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура БрокерПриИзменении(Элемент)
	
	РаботаСДокументамиКлиент.ДетализацияПоРасчетномуСчетуПриИзмененииСвязанныхРеквизитов(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ДивидендыНаЦеннуюБумагуПриИзменении(Элемент)
	
	Объект.СуммаОбъявленная = Объект.Количество * Объект.ДивидендыНаЦеннуюБумагу;
	Объект.Сумма            = Объект.СуммаОбъявленная * (1 - Объект.ПроцентНалога / 100);
		
КонецПроцедуры

&НаКлиенте
Процедура ПроцентНалогаПриИзменении(Элемент)
	
	Объект.Сумма = Объект.СуммаОбъявленная * (1 - Объект.ПроцентНалога / 100);
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаПриИзменении(Элемент)
	
	ПересчетПроцента(); 
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаОбъявленнаяПриИзменении(Элемент)
	
	ПересчетПроцента(); 
	
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)
	
	Объект.СуммаОбъявленная = Объект.Количество * Объект.ДивидендыНаЦеннуюБумагу * ?(ЭтоДоли(Объект.Рынок), 1/100, 1);
	Объект.Сумма			= Объект.СуммаОбъявленная * (1 - Объект.ПроцентНалога / 100);

КонецПроцедуры

&НаСервереБезКонтекста
Функция ЭтоДоли(Рынок)
	Возврат Рынок = Перечисления.РынкиЦенныхБумаг.Доли;
КонецФункции

&НаКлиенте
Процедура РынокПриИзменении(Элемент)
	
	Элементы.ЦеннаяБумага.ОграничениеТипа = РаботаСЦеннымиБумагамиКлиентСервер.ТипЦеннойБумагиВЗависимостиОтРынка(Объект.Рынок);
	Если ЭтоДоли(Объект.Рынок) Тогда
		Элементы.ДивидендыНаЦеннуюБумагу.Заголовок = "Общая сумма распределяемой прибыли";
	Иначе
		Элементы.ДивидендыНаЦеннуюБумагу.Заголовок = "Дивиденды на ценную бумагу";
	КонецЕсли;

КонецПроцедуры

/////////////////////////////////////////////////////////////////////////////////
#КонецОбласти

#Область ОБРАБОТЧИКИ_КОМАНД
/////////////////////////////////////////////////////////////////////////////////

&НаКлиенте
Процедура КомандаВыбратьИсполнителяПоДенежнымСредствам(Команда)
	
	РаботаСДокументамиКлиент.ВыбратьИсполнителяПоДенежнымСредствам(ЭтаФорма, ЭтаФорма.ОплатаЧерезБрокера);
	РасчетныйСчетПриИзменении(Неопределено);

КонецПроцедуры

/////////////////////////////////////////////////////////////////////////////////
#КонецОбласти

#Область СЛУЖЕБНЫЕ_ПРОЦЕДУРЫ_И_ФУНКЦИИ
/////////////////////////////////////////////////////////////////////////////////

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	ЭтаФорма.УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("Организация", Объект.Организация));
	
	Элементы.ЦеннаяБумага.ОграничениеТипа = РаботаСЦеннымиБумагамиКлиентСервер.ТипЦеннойБумагиВЗависимостиОтРынка(Объект.Рынок);
	ЭтаФорма.ДетализацияПоРасчетномуСчету = РаботаСДокументами.ТребуетсяДетализацияПоРасчетномуСчету(Объект);
	ЭтаФорма.ОплатаЧерезБрокера           = ?(ЗначениеЗаполнено(Объект.Брокер), 1, 0);
	Если ЭтоДоли(Объект.Рынок) Тогда
		Элементы.ДивидендыНаЦеннуюБумагу.Заголовок = "Общая сумма распределяемой прибыли";
	Иначе
		Элементы.ДивидендыНаЦеннуюБумагу.Заголовок = "Дивиденды на ценную бумагу";
	КонецЕсли;
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);

КонецПроцедуры //ПриЧтенииСозданииНаСервере()

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьИДоступность(Форма)
	
	Элементы = Форма.Элементы;
		
	Элементы.Брокер.Видимость = (Форма.ОплатаЧерезБрокера = 1);
	
	// элементы, зависящие от детализации по р/с
	РаботаСДокументамиКлиентСервер.НастроитьВидимостьИДоступностьРасчетногоСчетаИСвязанныхРеквизитов(Форма);
	
КонецПроцедуры // НастроитьВидимостьДоступность

&НаСервере
Процедура ЗаполнитьПодтверждениеОперацииНаСервере()

	РаботаСДокументами.ЗаполнитьПодтверждениеОперации(ЭтаФорма, Объект.Ссылка);		

КонецПроцедуры

/////////////////////////////////////////////////////////////////////////////////
#КонецОбласти

&НаКлиенте
Процедура ПересчетПроцента()
	
	Если Объект.СуммаОбъявленная >= Объект.Сумма Тогда
		Если Объект.Сумма <> 0 Тогда
			Объект.ПроцентНалога = ((Объект.СуммаОбъявленная - Объект.Сумма)/Объект.СуммаОбъявленная) * 100;
		Иначе
			Объект.ПроцентНалога = 100;
		КонецЕсли; 
	Иначе
		Объект.ПроцентНалога = 0;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сумма объявленная меньше суммы к получению!", ЭтотОбъект,, "СуммаОбъявленная" ,);
	КонецЕсли;

КонецПроцедуры
 
&НаКлиенте
Процедура ПровестиПоБухгалтерскомуУчету()

	РаботаСФормамиКлиент.ПровестиПоБухгалтерскомуУчету(ЭтаФорма); 

КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РаботаСДокументамиКлиент.СчетДоверительногоУправленияОбработкаВыбора(Объект, ЭтаФорма, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РаботаСДокументамиКлиент.ДатаОбработкаВыбора(Объект, ЭтаФорма, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетныйСчетПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.РасчетныйСчет) Тогда
		
		ВалютаРасчетногоСчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.РасчетныйСчет, "Валюта");
		
		Если Объект.ВалютаОплаты <> ВалютаРасчетногоСчета Тогда
		
			Объект.ВалютаОплаты = ВалютаРасчетногоСчета;
		
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаОплатыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РаботаСДокументамиКлиент.СверитьВыбранноеЗначениеВалютыСВалютойРасчетногоСчета(ВыбранноеЗначение, Объект.ВалютаОплаты, Объект.РасчетныйСчет);
	
КонецПроцедуры
